import { Agent } from "./agent";
import { tools } from "./tools";

async function main() {
	let apiKey = "KEY_HERE";

	console.log("\x1b[0;34m");
	console.log(" ██▀███    ▄▄▄        ██▓  ███▄    █ ");
	console.log("▓██ ▒ ██▒ ▒████▄     ▓██▒  ██ ▀█   █ ");
	console.log("▓██ ░▄█ ▒ ▒██  ▀█▄   ▒██▒ ▓██  ▀█ ██▒");
	console.log("▒██▀▀█▄   ░██▄▄▄▄██  ░██░ ▓██▒  ▐▌██▒");
	console.log("░██▓ ▒██▒  ▓█   ▓██▒ ░██░ ▒██░   ▓██░");
	console.log("░ ▒▓ ░▒▓░  ▒▒   ▓▒█░ ░▓   ░ ▒░   ▒ ▒ ");
	console.log("  ░▒ ░ ▒░   ▒   ▒▒ ░  ▒ ░ ░ ░░   ░ ▒░");
	console.log("  ░░   ░    ░   ▒     ▒ ░    ░   ░ ░ ");
	console.log("   ░            ░  ░  ░            ░ ");
	console.log("\x1b[0m\x1b[38;5;248m       (Ross's AI Noob v0.3)\x1b[0m");
	console.log();

	const agent = new Agent(apiKey, tools);
	await agent.run();
}

main();